lzyiii404/MyWorkSpace/STM32/Product/寒假培训作业/12/App/KeyOne/ProcKeyOne.c
/*********************************************************************************************************
* 模块名称: ProcKeyOne.c
* 摘    要: 独立按键处理模块，进行独立按键处理模块初始化，以及独立按键处理函数实现
* 当前版本: 1.0.0
* 作    者: SZLY(COPYRIGHT 2018 SZLY. All rights reserved.)
* 完成日期: 2018年01月01日  
* 内    容:
* 注    意: none                                                                  
**********************************************************************************************************
* 取代版本: 
* 作    者:
* 完成日期: 
* 修改内容:
* 修改文件: 
*********************************************************************************************************/

/*********************************************************************************************************
*                                              包含头文件
*********************************************************************************************************/
#include <stm32f10x_conf.h>
#include "ProcKeyOne.h"
#include "UART1.h"
#include "Flash.h"
#include "OLED.h"
/*********************************************************************************************************
*                                              宏定义
*********************************************************************************************************/
#define MAX_WR_LEN            100
#define FLASH_START_ADDR1     0x0800C000
#define BUF_SIZE              8
/*********************************************************************************************************
*                                              枚举结构体定义
*********************************************************************************************************/

/*********************************************************************************************************
*                                              内部变量
*********************************************************************************************************/
const u32 BUF0_U32[] = {0x12345678};
const u32 BUF1_U32[] = {0x87654321};
/*********************************************************************************************************
*                                              内部函数声明
*********************************************************************************************************/

/*********************************************************************************************************
*                                              内部函数实现
*********************************************************************************************************/

/*********************************************************************************************************
*                                              API函数实现
*********************************************************************************************************/
/*********************************************************************************************************
* 函数名称: InitProcKeyOne
* 函数功能: 初始化ProcKeyOne
* 输入参数: void
* 输出参数: void
* 返 回 值: void
* 创建日期: 2018年01月01日
* 注    意:
*********************************************************************************************************/
void InitProcKeyOne(void)
{
  
}

/*********************************************************************************************************
* 函数名称: ProcKeyDownKey1
* 函数功能: 处理按键按下的事件，即按键按下的响应函数 
* 输入参数: void
* 输出参数: void
* 返 回 值: void
* 创建日期: 2018年01月01日
* 注    意: 
*********************************************************************************************************/
void  ProcKeyDownKey1(void)
{
  STM32FlashWriteWord(FLASH_START_ADDR1, (u32*)BUF0_U32, BUF_SIZE / 8);
  OLEDShowString(8, 16, "0x12345678");
  printf("write Flash: 0x12345678\r\n");
  // printf("KEY1 PUSH DOWN\r\n");  //打印按键状态
}

/*********************************************************************************************************
* 函数名称: ProcKeyUpKey1
* 函数功能: 处理按键弹起的事件，即按键弹起的响应函数 
* 输入参数: void
* 输出参数: void
* 返 回 值: void
* 创建日期: 2018年01月01日
* 注    意: 
*********************************************************************************************************/
void  ProcKeyUpKey1(void)
{
  // printf("KEY1 RELEASE\r\n");   //打印按键状态
}

/*********************************************************************************************************
* 函数名称: ProcKeyDownKey2
* 函数功能: 处理按键按下的事件，即按键按下的响应函数 
* 输入参数: void
* 输出参数: void
* 返 回 值: void
* 创建日期: 2018年01月01日
* 注    意: 
*********************************************************************************************************/
void  ProcKeyDownKey2(void)
{
  STM32FlashWriteWord(FLASH_START_ADDR1, (u32*)BUF1_U32, BUF_SIZE / 8);
  OLEDShowString(8, 16, "0x87654321");
  printf("writ Flash: 0x87654321\r\n");
  // printf("KEY2 PUSH DOWN\r\n");   //打印按键状态
}

/*********************************************************************************************************
* 函数名称: ProcKeyUpKey2
* 函数功能: 处理按键弹起的事件，即按键弹起的响应函数 
* 输入参数: void
* 输出参数: void
* 返 回 值: void
* 创建日期: 2018年01月01日
* 注    意: 
*********************************************************************************************************/
void  ProcKeyUpKey2(void)
{  
  // printf("KEY2 RELEASE\r\n");     //打印按键状态
}

/*********************************************************************************************************
* 函数名称: ProcKeyDownKey3
* 函数功能: 处理按键按下的事件，即按键按下的响应函数 
* 输入参数: void
* 输出参数: void
* 返 回 值: void
* 创建日期: 2018年01月01日
* 注    意: 
*********************************************************************************************************/
void  ProcKeyDownKey3(void)
{
  i16 i;
  u32 arr[MAX_WR_LEN];

  printf("Read Flash:");
  STM32FlashReadWord(FLASH_START_ADDR1, arr, BUF_SIZE / 8);
  OLEDClear();

  if (arr[0] == 0x12345678)
  {

    OLEDShowString(8, 16, "Success");
    printf("Success");
  }
  else
  {
    OLEDShowString(8, 16, "Error");
    printf("Error");
  }
  printf("\r\n");
  // printf("KEY3 PUSH DOWN\r\n");   //打印按键状态
}

/*********************************************************************************************************
* 函数名称: ProcKeyUpKey3
* 函数功能: 处理按键弹起的事件，即按键弹起的响应函数 
* 输入参数: void
* 输出参数: void
* 返 回 值: void
* 创建日期: 2018年01月01日
* 注    意: 
*********************************************************************************************************/
void  ProcKeyUpKey3(void)
{  
  // printf("KEY3 RELEASE\r\n");     //打印按键状态
}
